suturo_planning_pm_perception/doc/suturo-planning-pm-perception.org
#+TITLE: The SUTURO-PLANNING-PM-PERCEPTION package
#+AUTHOR: CLOD
#+EMAIL: your@email.here
#+LINK: hs http://www.lispworks.com/reference/HyperSpec//%s
#+STARTUP: showall
#+OPTIONS: toc:4 H:10 @:t tags:nil

# link target 2: <<suturo-planning-pm-perception>>
# link target: <<package suturo-planning-pm-perception>>


* Internal Package: =suturo-planning-pm-perception=                      :package:

- Uses:
    [[package cram-designators][cram-designators]], [[package common-lisp][common
    lisp]], [[package cl-transforms][cl-transforms]], [[package cram-language
    implementation][cram-language-implementation]], [[package suturo-planning
    constants][suturo-planning-constants]]
- Used by:
    [[package suturo-planning-executive][suturo-planning-executive]]


** Description

Not documented.


** External Symbols




*** External Classes

-----

# link target: <<class suturo-planning-pm-perception>>


**** Internal Class: =suturo-planning-pm-perception=                          :class:


***** Inheritance

- Parent classes:
    [[class process-module][process-module]]
- Precedence list:
    [[class suturo-planning-pm-perception][suturo-planning-pm-perception]], [[class
    process-module][process-module]], [[class abstract-process-module][abstract
    process-module]], [[class standard-object][standard-object]], [[class slot
    object][slot-object]], [[class t][t]]
- Direct subclasses:
    None.


***** Description

Not documented.


***** Direct Slots



***** Indirect Slots

# link target 2: <<unprocessed-results>>
# link target: <<slot unprocessed-results>>


****** Slot: =unprocessed-results=                                               :slot:

- Value type: =t=
- Initial value: =(MAKE-HASH-TABLE :WEAKNESS :KEY :SYNCHRONIZED T)=
- Initargs: none
- Allocation: instance


# link target 2: <<result>>
# link target: <<slot result>>


****** Internal Slot: =result=                                                   :slot:

- Value type: =t=
- Initial value: =NIL=
- Initargs: none
- Allocation: instance


# link target 2: <<execute-lock>>
# link target: <<slot execute-lock>>


****** Slot: =execute-lock=                                                      :slot:

- Value type: =t=
- Initial value: =(SB-THREAD:MAKE-MUTEX)=
- Initargs: none
- Allocation: instance


# link target 2: <<caller>>
# link target: <<slot caller>>


****** Slot: =caller=                                                            :slot:

- Value type: =t=
- Initial value: =NIL=
- Initargs: none
- Allocation: instance


# link target 2: <<cancel>>
# link target: <<slot cancel>>


****** Slot: =cancel=                                                            :slot:

- Value type: =t=
- Initial value: =NIL=
- Initargs: none
- Allocation: instance


# link target 2: <<status>>
# link target: <<slot status>>


****** Slot: =status=                                                            :slot:

- Value type: =t=
- Initial value: =NIL=
- Initargs: none
- Allocation: instance


# link target 2: <<input>>
# link target: <<slot input>>


****** Slot: =input=                                                             :slot:

- Value type: =t=
- Initial value: =NIL=
- Initargs: none
- Allocation: instance


# link target 2: <<name>>
# link target: <<slot name>>


****** Internal Slot: =name=                                                     :slot:

- Value type: =t=
- Initial value: =(ERROR "Process modules need a name.")=
- Initargs: name
- Allocation: instance








** Internal Symbols




*** Internal Global Variables

-----

# link target 2: <<*body*>>
# link target: <<variable *body*>>


**** Variable: =*body*=                                                    :variable:


***** Value

: (" * Arguments - objects :: objects from the yaml file * Description Tries to
: map a region from the map to every object from the yaml file "  (LET ((SUTURO
: PLANNING-PM-PERCEPTION::REGIONS         (SUTURO-PLANNING-PM-PERCEPTION::GET
: REGIONS))        (SUTURO-PLANNING-PM-PERCEPTION::CLASSIFIED-REGIONS        
: (MAKE-ARRAY 0 :FILL-POINTER 0 :ADJUSTABLE T)))    (SUTURO-PLANNING-PM
: PERCEPTION::COMPARE-OBJECT-AND-REGIONS     CRAM-DESIGNATOR-PROPERTIES:OBJECTS
: SUTURO-PLANNING-PM-PERCEPTION::REGIONS     SUTURO-PLANNING-PM
: PERCEPTION::CLASSIFIED-REGIONS)    SUTURO-PLANNING-PM-PERCEPTION::CLASSIFIED
: REGIONS))

Type: =cons=


***** Description

Not documented.





