suturo_planning_pm_perception/doc/suturo-planning-pm-perception.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The SUTURO-PLANNING-PM-PERCEPTION package</title>
<!-- 2015-03-13 Fr 14:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="CLOD" />
</head>
<body>
<div id="content">
<h1 class="title">The SUTURO-PLANNING-PM-PERCEPTION package</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Internal Package: <code>suturo-planning-pm-perception</code></a>
<ul>
<li><a href="#sec-1-1">1.1. Description</a></li>
<li><a href="#sec-1-2">1.2. External Symbols</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. External Classes</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1. Internal Class: <code>suturo-planning-pm-perception</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Internal Symbols</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Internal Global Variables</a>
<ul>
<li><a href="#sec-1-3-1-1">1.3.1.1. Variable: <code>*body*</code></a></li>
</ul>
</li>
<li><a href="#sec-1-3-2">1.3.2. Internal Macros</a>
<ul>
<li><a href="#sec-1-3-2-1">1.3.2.1. Macro: <code>def-action-handler</code></a></li>
</ul>
</li>
<li><a href="#sec-1-3-3">1.3.3. Internal Functions</a>
<ul>
<li><a href="#sec-1-3-3-1">1.3.3.1. Function: <code>add-region-to-classified-regions</code></a></li>
<li><a href="#sec-1-3-3-2">1.3.3.2. Function: <code>analyze-perceived-object</code></a></li>
<li><a href="#sec-1-3-3-3">1.3.3.3. Function: <code>call-classify-object</code></a></li>
<li><a href="#sec-1-3-3-4">1.3.3.4. Function: <code>call-euroc-object-to-odom-combined</code></a></li>
<li><a href="#sec-1-3-3-5">1.3.3.5. Function: <code>call-gripper-service</code></a></li>
<li><a href="#sec-1-3-3-6">1.3.3.6. Function: <code>call-scene-service</code></a></li>
<li><a href="#sec-1-3-3-7">1.3.3.7. Function: <code>call-service-add-point-cloud</code></a></li>
<li><a href="#sec-1-3-3-8">1.3.3.8. Function: <code>compare-object-and-regions</code></a></li>
<li><a href="#sec-1-3-3-9">1.3.3.9. Function: <code>create-capability-string</code></a></li>
<li><a href="#sec-1-3-3-10">1.3.3.10. Function: <code>find-regions-with-same-color</code></a></li>
<li><a href="#sec-1-3-3-11">1.3.3.11. Function: <code>get-obj-color</code></a></li>
<li><a href="#sec-1-3-3-12">1.3.3.12. Function: <code>get-region-color</code></a></li>
<li><a href="#sec-1-3-3-13">1.3.3.13. Function: <code>get-regions</code></a></li>
<li><a href="#sec-1-3-3-14">1.3.3.14. Function: <code>get-scene-perception</code></a></li>
<li><a href="#sec-1-3-3-15">1.3.3.15. Function: <code>handle-object</code></a></li>
<li><a href="#sec-1-3-3-16">1.3.3.16. Function: <code>handle-object-obstacle</code></a></li>
<li><a href="#sec-1-3-3-17">1.3.3.17. Function: <code>handle-object-unknown-or-table</code></a></li>
<li><a href="#sec-1-3-3-18">1.3.3.18. Function: <code>recognize-objects-of-interest</code></a></li>
</ul>
</li>
<li><a href="#sec-1-3-4">1.3.4. Internal Generic Functions</a>
<ul>
<li><a href="#sec-1-3-4-1">1.3.4.1. Generic Function: <code>call-action</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Ambiguous Symbols</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Suturo-Planning-Pm-Perception</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Index</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Nonalphabetic</a></li>
<li><a href="#sec-1-5-2">1.5.2. A</a></li>
<li><a href="#sec-1-5-3">1.5.3. C</a></li>
<li><a href="#sec-1-5-4">1.5.4. D</a></li>
<li><a href="#sec-1-5-5">1.5.5. F</a></li>
<li><a href="#sec-1-5-6">1.5.6. G</a></li>
<li><a href="#sec-1-5-7">1.5.7. H</a></li>
<li><a href="#sec-1-5-8">1.5.8. R</a></li>
<li><a href="#sec-1-5-9">1.5.9. S</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Colophon</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Internal Package: <code>suturo-planning-pm-perception</code></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Uses:
<i>cram-designators</i>, <i>common
lisp</i>, <i>cl-transforms</i>, <i>cram-language-implementation</i>, <i>suturo-planning-constants</i>
</li>
<li>Used by:
<i>suturo-planning-executive</i>
</li>
</ul>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Not documented.
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> External Symbols</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> External Classes</h4>
<div class="outline-text-4" id="text-1-2-1">
<hr  />
</div>


<div id="outline-container-sec-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> Internal Class: <code>suturo-planning-pm-perception</code></h5>
<div class="outline-text-5" id="text-1-2-1-1">
</div><div id="outline-container-sec-1-2-1-1-1" class="outline-6">
<h6 id="sec-1-2-1-1-1"><span class="section-number-6">1.2.1.1.1</span> Inheritance</h6>
<div class="outline-text-6" id="text-1-2-1-1-1">
<ul class="org-ul">
<li>Parent classes:
<i>process-module</i>
</li>
<li>Precedence list:
<i>suturo-planning-pm-perception</i>, <i>process-module</i>, <i>abstract
process-module</i>, <i>standard-object</i>, <i>slot-object</i>, <i>t</i>
</li>
<li>Direct subclasses:
None.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-2" class="outline-6">
<h6 id="sec-1-2-1-1-2"><span class="section-number-6">1.2.1.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-2-1-1-2">
<p>
Not documented.
</p>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-3" class="outline-6">
<h6 id="sec-1-2-1-1-3"><span class="section-number-6">1.2.1.1.3</span> Direct Slots</h6>
</div>



<div id="outline-container-sec-1-2-1-1-4" class="outline-6">
<h6 id="sec-1-2-1-1-4"><span class="section-number-6">1.2.1.1.4</span> Indirect Slots</h6>
<div class="outline-text-6" id="text-1-2-1-1-4">
</div>


<div id="outline-container-sec-1-2-1-1-4-1" class="outline-7">
<h7 id="sec-1-2-1-1-4-1"><span class="section-number-7">1.2.1.1.4.1</span> Slot: <code>unprocessed-results</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-1">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>(MAKE-HASH-TABLE :WEAKNESS :KEY :SYNCHRONIZED T)</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-2" class="outline-7">
<h7 id="sec-1-2-1-1-4-2"><span class="section-number-7">1.2.1.1.4.2</span> Internal Slot: <code>result</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-2">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>NIL</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-3" class="outline-7">
<h7 id="sec-1-2-1-1-4-3"><span class="section-number-7">1.2.1.1.4.3</span> Slot: <code>execute-lock</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-3">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>(SB-THREAD:MAKE-MUTEX)</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-4" class="outline-7">
<h7 id="sec-1-2-1-1-4-4"><span class="section-number-7">1.2.1.1.4.4</span> Slot: <code>caller</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-4">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>NIL</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-5" class="outline-7">
<h7 id="sec-1-2-1-1-4-5"><span class="section-number-7">1.2.1.1.4.5</span> Slot: <code>cancel</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-5">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>NIL</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-6" class="outline-7">
<h7 id="sec-1-2-1-1-4-6"><span class="section-number-7">1.2.1.1.4.6</span> Slot: <code>status</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-6">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>NIL</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-7" class="outline-7">
<h7 id="sec-1-2-1-1-4-7"><span class="section-number-7">1.2.1.1.4.7</span> Slot: <code>input</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-7">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>NIL</code>
</li>
<li>Initargs: none
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2-1-1-4-8" class="outline-7">
<h7 id="sec-1-2-1-1-4-8"><span class="section-number-7">1.2.1.1.4.8</span> Internal Slot: <code>name</code></h7>
<div class="outline-text-7" id="text-1-2-1-1-4-8">
<ul class="org-ul">
<li>Value type: <code>t</code>
</li>
<li>Initial value: <code>(ERROR "Process modules need a name.")</code>
</li>
<li>Initargs: name
</li>
<li>Allocation: instance
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>








<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Internal Symbols</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Internal Global Variables</h4>
<div class="outline-text-4" id="text-1-3-1">
<hr  />
</div>


<div id="outline-container-sec-1-3-1-1" class="outline-5">
<h5 id="sec-1-3-1-1"><span class="section-number-5">1.3.1.1</span> Variable: <code>*body*</code></h5>
<div class="outline-text-5" id="text-1-3-1-1">
</div><div id="outline-container-sec-1-3-1-1-1" class="outline-6">
<h6 id="sec-1-3-1-1-1"><span class="section-number-6">1.3.1.1.1</span> Value</h6>
<div class="outline-text-6" id="text-1-3-1-1-1">
<pre class="example">
(" * Arguments - objects :: objects from the yaml file * Description Tries to
map a region from the map to every object from the yaml file "  (LET ((SUTURO
PLANNING-PM-PERCEPTION::REGIONS         (SUTURO-PLANNING-PM-PERCEPTION::GET
REGIONS))        (SUTURO-PLANNING-PM-PERCEPTION::CLASSIFIED-REGIONS        
(MAKE-ARRAY 0 :FILL-POINTER 0 :ADJUSTABLE T)))    (SUTURO-PLANNING-PM
PERCEPTION::COMPARE-OBJECT-AND-REGIONS     CRAM-DESIGNATOR-PROPERTIES:OBJECTS
SUTURO-PLANNING-PM-PERCEPTION::REGIONS     SUTURO-PLANNING-PM
PERCEPTION::CLASSIFIED-REGIONS)    SUTURO-PLANNING-PM-PERCEPTION::CLASSIFIED
REGIONS))
</pre>

<p>
Type: <code>cons</code>
</p>
</div>
</div>
