suturo_planning_pm_perception/doc/suturo-planning-pm-perception.org
*** Internal Macros

-----

# link target 2: <<def-action-handler>>
# link target: <<macro def-action-handler>>


**** Macro: =def-action-handler=                                              :macro:


***** Syntax

#+BEGIN_SRC lisp
(def-action-handler name
    args
  &body
  body)
#+END_SRC


***** Description

Not documented.





*** Internal Functions

-----

# link target 2: <<add-region-to-classified-regions>>
# link target: <<function add-region-to-classified-regions>>


**** Function: =add-region-to-classified-regions=                          :function:


***** Syntax

#+BEGIN_SRC lisp
(add-region-to-classified-regions region classified-regions)
#+END_SRC


***** Description


***** Arguments

- region :: a region
- classified-regions :: an array of regions 
Adds a region to the array classified-regions.



-----

# link target 2: <<analyze-perceived-object>>
# link target: <<function analyze-perceived-object>>


**** Function: =analyze-perceived-object=                                  :function:


***** Syntax

#+BEGIN_SRC lisp
(analyze-perceived-object object)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<call-classify-object>>
# link target: <<function call-classify-object>>


**** Function: =call-classify-object=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(call-classify-object object)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<call-euroc-object-to-odom-combined>>
# link target: <<function call-euroc-object-to-odom-combined>>


**** Function: =call-euroc-object-to-odom-combined=                        :function:


***** Syntax

#+BEGIN_SRC lisp
(call-euroc-object-to-odom-combined object)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<call-gripper-service>>
# link target: <<function call-gripper-service>>


**** Function: =call-gripper-service=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(call-gripper-service options)
#+END_SRC


***** Description


***** Arguments

- options :: The options that the service call transmits to the receiver
***** Description

Call the service suturo/GetGripper



-----

# link target 2: <<call-scene-service>>
# link target: <<function call-scene-service>>


**** Function: =call-scene-service=                                        :function:


***** Syntax

#+BEGIN_SRC lisp
(call-scene-service options)
#+END_SRC


***** Description


***** Arguments

- options :: The options that the service call transmits to the receiver
***** Description

Calls the service suturo/GetScene



-----

# link target 2: <<call-service-add-point-cloud>>
# link target: <<function call-service-add-point-cloud>>


**** Function: =call-service-add-point-cloud=                              :function:


***** Syntax

#+BEGIN_SRC lisp
(call-service-add-point-cloud scenecam &optional arm-origin)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<compare-object-and-regions>>
# link target: <<function compare-object-and-regions>>


**** Function: =compare-object-and-regions=                                :function:


***** Syntax

#+BEGIN_SRC lisp
(compare-object-and-regions yaml-objects regions classified-regions)
#+END_SRC


***** Description


***** Arguments

- yaml-objects :: objects from the yaml file
- regions :: regions from the scanned map
- classified-regions :: array where the regions that could be mapped will be stored
***** Description

Loops over the objects and calculates how many regions have the same color as the object. If this is one, the region is added to the array classified-regions.



-----

# link target 2: <<create-capability-string>>
# link target: <<function create-capability-string>>


**** Function: =create-capability-string=                                  :function:


***** Syntax

#+BEGIN_SRC lisp
(create-capability-string &optional (cuboid 1) (pose-estimation nil)
                          (object-ids nil))
#+END_SRC


***** Description


***** Arguments

- cuboid :: 
- pose-estimation :: Determines wether perception pipeline should estimate the pose of the objects
- object-ids :: Ids of the objects
