suturo_planning_pm_perception/doc/suturo-planning-pm-perception.html


<div id="outline-container-sec-1-3-1-1-2" class="outline-6">
<h6 id="sec-1-3-1-1-2"><span class="section-number-6">1.3.1.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-1-1-2">
<p>
Not documented.
</p>
</div>
</div>
</div>
</div>





<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Internal Macros</h4>
<div class="outline-text-4" id="text-1-3-2">
<hr  />
</div>


<div id="outline-container-sec-1-3-2-1" class="outline-5">
<h5 id="sec-1-3-2-1"><span class="section-number-5">1.3.2.1</span> Macro: <code>def-action-handler</code></h5>
<div class="outline-text-5" id="text-1-3-2-1">
</div><div id="outline-container-sec-1-3-2-1-1" class="outline-6">
<h6 id="sec-1-3-2-1-1"><span class="section-number-6">1.3.2.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-2-1-1">
<div class="org-src-container">

<pre class="src src-lisp">(def-action-handler name
    args
  &amp;body
  body)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2-1-2" class="outline-6">
<h6 id="sec-1-3-2-1-2"><span class="section-number-6">1.3.2.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-2-1-2">
<p>
Not documented.
</p>
</div>
</div>
</div>
</div>





<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Internal Functions</h4>
<div class="outline-text-4" id="text-1-3-3">
<hr  />
</div>


<div id="outline-container-sec-1-3-3-1" class="outline-5">
<h5 id="sec-1-3-3-1"><span class="section-number-5">1.3.3.1</span> Function: <code>add-region-to-classified-regions</code></h5>
<div class="outline-text-5" id="text-1-3-3-1">
</div><div id="outline-container-sec-1-3-3-1-1" class="outline-6">
<h6 id="sec-1-3-3-1-1"><span class="section-number-6">1.3.3.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-1-1">
<div class="org-src-container">

<pre class="src src-lisp">(add-region-to-classified-regions region classified-regions)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-1-2" class="outline-6">
<h6 id="sec-1-3-3-1-2"><span class="section-number-6">1.3.3.1.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-1-3" class="outline-6">
<h6 id="sec-1-3-3-1-3"><span class="section-number-6">1.3.3.1.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-1-3">
<dl class="org-dl">
<dt> region </dt><dd>a region
</dd>
<dt> classified-regions </dt><dd>an array of regions 
</dd>
</dl>
<p>
Adds a region to the array classified-regions.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-2" class="outline-5">
<h5 id="sec-1-3-3-2"><span class="section-number-5">1.3.3.2</span> Function: <code>analyze-perceived-object</code></h5>
<div class="outline-text-5" id="text-1-3-3-2">
</div><div id="outline-container-sec-1-3-3-2-1" class="outline-6">
<h6 id="sec-1-3-3-2-1"><span class="section-number-6">1.3.3.2.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-2-1">
<div class="org-src-container">

<pre class="src src-lisp">(analyze-perceived-object object)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-2-2" class="outline-6">
<h6 id="sec-1-3-3-2-2"><span class="section-number-6">1.3.3.2.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-2-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-3" class="outline-5">
<h5 id="sec-1-3-3-3"><span class="section-number-5">1.3.3.3</span> Function: <code>call-classify-object</code></h5>
<div class="outline-text-5" id="text-1-3-3-3">
</div><div id="outline-container-sec-1-3-3-3-1" class="outline-6">
<h6 id="sec-1-3-3-3-1"><span class="section-number-6">1.3.3.3.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-3-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-classify-object object)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-3-2" class="outline-6">
<h6 id="sec-1-3-3-3-2"><span class="section-number-6">1.3.3.3.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-3-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-4" class="outline-5">
<h5 id="sec-1-3-3-4"><span class="section-number-5">1.3.3.4</span> Function: <code>call-euroc-object-to-odom-combined</code></h5>
<div class="outline-text-5" id="text-1-3-3-4">
</div><div id="outline-container-sec-1-3-3-4-1" class="outline-6">
<h6 id="sec-1-3-3-4-1"><span class="section-number-6">1.3.3.4.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-4-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-euroc-object-to-odom-combined object)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-4-2" class="outline-6">
<h6 id="sec-1-3-3-4-2"><span class="section-number-6">1.3.3.4.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-4-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-5" class="outline-5">
<h5 id="sec-1-3-3-5"><span class="section-number-5">1.3.3.5</span> Function: <code>call-gripper-service</code></h5>
<div class="outline-text-5" id="text-1-3-3-5">
</div><div id="outline-container-sec-1-3-3-5-1" class="outline-6">
<h6 id="sec-1-3-3-5-1"><span class="section-number-6">1.3.3.5.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-5-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-gripper-service options)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-5-2" class="outline-6">
<h6 id="sec-1-3-3-5-2"><span class="section-number-6">1.3.3.5.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-5-3" class="outline-6">
<h6 id="sec-1-3-3-5-3"><span class="section-number-6">1.3.3.5.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-5-3">
<dl class="org-dl">
<dt> options </dt><dd>The options that the service call transmits to the receiver
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-5-4" class="outline-6">
<h6 id="sec-1-3-3-5-4"><span class="section-number-6">1.3.3.5.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-5-4">
<p>
Call the service suturo/GetGripper
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-6" class="outline-5">
<h5 id="sec-1-3-3-6"><span class="section-number-5">1.3.3.6</span> Function: <code>call-scene-service</code></h5>
<div class="outline-text-5" id="text-1-3-3-6">
</div><div id="outline-container-sec-1-3-3-6-1" class="outline-6">
<h6 id="sec-1-3-3-6-1"><span class="section-number-6">1.3.3.6.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-6-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-scene-service options)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-6-2" class="outline-6">
<h6 id="sec-1-3-3-6-2"><span class="section-number-6">1.3.3.6.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-6-3" class="outline-6">
<h6 id="sec-1-3-3-6-3"><span class="section-number-6">1.3.3.6.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-6-3">
<dl class="org-dl">
<dt> options </dt><dd>The options that the service call transmits to the receiver
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-6-4" class="outline-6">
<h6 id="sec-1-3-3-6-4"><span class="section-number-6">1.3.3.6.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-6-4">
<p>
Calls the service suturo/GetScene
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-7" class="outline-5">
<h5 id="sec-1-3-3-7"><span class="section-number-5">1.3.3.7</span> Function: <code>call-service-add-point-cloud</code></h5>
<div class="outline-text-5" id="text-1-3-3-7">
</div><div id="outline-container-sec-1-3-3-7-1" class="outline-6">
<h6 id="sec-1-3-3-7-1"><span class="section-number-6">1.3.3.7.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-7-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-service-add-point-cloud scenecam &amp;optional arm-origin)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-7-2" class="outline-6">
<h6 id="sec-1-3-3-7-2"><span class="section-number-6">1.3.3.7.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-7-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-8" class="outline-5">
<h5 id="sec-1-3-3-8"><span class="section-number-5">1.3.3.8</span> Function: <code>compare-object-and-regions</code></h5>
<div class="outline-text-5" id="text-1-3-3-8">
</div><div id="outline-container-sec-1-3-3-8-1" class="outline-6">
<h6 id="sec-1-3-3-8-1"><span class="section-number-6">1.3.3.8.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-8-1">
<div class="org-src-container">

<pre class="src src-lisp">(compare-object-and-regions yaml-objects regions classified-regions)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-8-2" class="outline-6">
<h6 id="sec-1-3-3-8-2"><span class="section-number-6">1.3.3.8.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-8-3" class="outline-6">
<h6 id="sec-1-3-3-8-3"><span class="section-number-6">1.3.3.8.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-8-3">
<dl class="org-dl">
<dt> yaml-objects </dt><dd>objects from the yaml file
</dd>
<dt> regions </dt><dd>regions from the scanned map
</dd>
<dt> classified-regions </dt><dd>array where the regions that could be mapped will be stored
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-8-4" class="outline-6">
<h6 id="sec-1-3-3-8-4"><span class="section-number-6">1.3.3.8.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-8-4">
<p>
Loops over the objects and calculates how many regions have the same color as the object. If this is one, the region is added to the array classified-regions.
</p>



<hr  />
</div>
</div>
</div>
