suturo_planning_pm_perception/doc/suturo-planning-pm-perception.org
***** Description

Create the string that describes which capabilities are used by the perception



-----

# link target 2: <<find-regions-with-same-color>>
# link target: <<function find-regions-with-same-color>>


**** Function: =find-regions-with-same-color=                              :function:


***** Syntax

#+BEGIN_SRC lisp
(find-regions-with-same-color obj regions)
#+END_SRC


***** Description


***** Arguments

- obj :: is an object from the yaml-file
- regions :: an array of all regions
***** Description

Loops over all regions and compares their color with the color of the object. If the color matches the region is added to an array which is returned at the end.



-----

# link target 2: <<get-obj-color>>
# link target: <<function get-obj-color>>


**** Function: =get-obj-color=                                             :function:


***** Syntax

#+BEGIN_SRC lisp
(get-obj-color obj)
#+END_SRC


***** Description


***** Arguments

- obj :: an object from the yaml file
***** Description

Returns the color of the object



-----

# link target 2: <<get-region-color>>
# link target: <<function get-region-color>>


**** Function: =get-region-color=                                          :function:


***** Syntax

#+BEGIN_SRC lisp
(get-region-color region)
#+END_SRC


***** Description


***** Arguments

- region :: a region
***** Description

Returns the color of the region



-----

# link target 2: <<get-regions>>
# link target: <<function get-regions>>


**** Function: =get-regions=                                               :function:


***** Syntax

#+BEGIN_SRC lisp
(get-regions)
#+END_SRC


***** Description


***** Description

Returns the Obstacle Regions from the map



-----

# link target 2: <<get-scene-perception>>
# link target: <<function get-scene-perception>>


**** Function: =get-scene-perception=                                      :function:


***** Syntax

#+BEGIN_SRC lisp
(get-scene-perception &optional (cuboid 1) (pose-estimation nil)
                      (object-ids nil))
#+END_SRC


***** Description


***** Arguments

- cuboid ::
- pose-estimation :: Determines wether perception pipeline should estimate the pose of the objects
- object-ids :: Ids of the objects
***** Description

Get the objects recognized by the scene camera



-----

# link target 2: <<handle-object>>
# link target: <<function handle-object>>


**** Function: =handle-object=                                             :function:


***** Syntax

#+BEGIN_SRC lisp
(handle-object matched-object)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<handle-object-obstacle>>
# link target: <<function handle-object-obstacle>>


**** Function: =handle-object-obstacle=                                    :function:


***** Syntax

#+BEGIN_SRC lisp
(handle-object-obstacle matched-object)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<handle-object-unknown-or-table>>
# link target: <<function handle-object-unknown-or-table>>


**** Function: =handle-object-unknown-or-table=                            :function:


***** Syntax

#+BEGIN_SRC lisp
(handle-object-unknown-or-table matched-object)
#+END_SRC


***** Description

Not documented.



-----

# link target 2: <<recognize-objects-of-interest>>
# link target: <<function recognize-objects-of-interest>>


**** Function: =recognize-objects-of-interest=                             :function:


***** Syntax

#+BEGIN_SRC lisp
(recognize-objects-of-interest colors)
#+END_SRC


***** Description


***** Arguments

- colors :: Colors of the objects
***** Description

Recognizes Objects of Interest. It gets a list of colors and returns a list of objects that matches these colors.





*** Internal Generic Functions

-----

# link target 2: <<call-action>>
# link target: <<generic-function call-action>>


