suturo_planning_pm_perception/doc/suturo-planning-pm-perception.html


<div id="outline-container-sec-1-3-3-9" class="outline-5">
<h5 id="sec-1-3-3-9"><span class="section-number-5">1.3.3.9</span> Function: <code>create-capability-string</code></h5>
<div class="outline-text-5" id="text-1-3-3-9">
</div><div id="outline-container-sec-1-3-3-9-1" class="outline-6">
<h6 id="sec-1-3-3-9-1"><span class="section-number-6">1.3.3.9.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-9-1">
<div class="org-src-container">

<pre class="src src-lisp">(create-capability-string &amp;optional (cuboid 1) (pose-estimation nil)
                          (object-ids nil))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-9-2" class="outline-6">
<h6 id="sec-1-3-3-9-2"><span class="section-number-6">1.3.3.9.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-9-3" class="outline-6">
<h6 id="sec-1-3-3-9-3"><span class="section-number-6">1.3.3.9.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-9-3">
<dl class="org-dl">
<dt> cuboid </dt><dd></dd>
<dt> pose-estimation </dt><dd>Determines wether perception pipeline should estimate the pose of the objects
</dd>
<dt> object-ids </dt><dd>Ids of the objects
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-9-4" class="outline-6">
<h6 id="sec-1-3-3-9-4"><span class="section-number-6">1.3.3.9.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-9-4">
<p>
Create the string that describes which capabilities are used by the perception
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-10" class="outline-5">
<h5 id="sec-1-3-3-10"><span class="section-number-5">1.3.3.10</span> Function: <code>find-regions-with-same-color</code></h5>
<div class="outline-text-5" id="text-1-3-3-10">
</div><div id="outline-container-sec-1-3-3-10-1" class="outline-6">
<h6 id="sec-1-3-3-10-1"><span class="section-number-6">1.3.3.10.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-10-1">
<div class="org-src-container">

<pre class="src src-lisp">(find-regions-with-same-color obj regions)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-10-2" class="outline-6">
<h6 id="sec-1-3-3-10-2"><span class="section-number-6">1.3.3.10.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-10-3" class="outline-6">
<h6 id="sec-1-3-3-10-3"><span class="section-number-6">1.3.3.10.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-10-3">
<dl class="org-dl">
<dt> obj </dt><dd>is an object from the yaml-file
</dd>
<dt> regions </dt><dd>an array of all regions
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-10-4" class="outline-6">
<h6 id="sec-1-3-3-10-4"><span class="section-number-6">1.3.3.10.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-10-4">
<p>
Loops over all regions and compares their color with the color of the object. If the color matches the region is added to an array which is returned at the end.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-11" class="outline-5">
<h5 id="sec-1-3-3-11"><span class="section-number-5">1.3.3.11</span> Function: <code>get-obj-color</code></h5>
<div class="outline-text-5" id="text-1-3-3-11">
</div><div id="outline-container-sec-1-3-3-11-1" class="outline-6">
<h6 id="sec-1-3-3-11-1"><span class="section-number-6">1.3.3.11.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-11-1">
<div class="org-src-container">

<pre class="src src-lisp">(get-obj-color obj)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-11-2" class="outline-6">
<h6 id="sec-1-3-3-11-2"><span class="section-number-6">1.3.3.11.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-11-3" class="outline-6">
<h6 id="sec-1-3-3-11-3"><span class="section-number-6">1.3.3.11.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-11-3">
<dl class="org-dl">
<dt> obj </dt><dd>an object from the yaml file
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-11-4" class="outline-6">
<h6 id="sec-1-3-3-11-4"><span class="section-number-6">1.3.3.11.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-11-4">
<p>
Returns the color of the object
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-12" class="outline-5">
<h5 id="sec-1-3-3-12"><span class="section-number-5">1.3.3.12</span> Function: <code>get-region-color</code></h5>
<div class="outline-text-5" id="text-1-3-3-12">
</div><div id="outline-container-sec-1-3-3-12-1" class="outline-6">
<h6 id="sec-1-3-3-12-1"><span class="section-number-6">1.3.3.12.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-12-1">
<div class="org-src-container">

<pre class="src src-lisp">(get-region-color region)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-12-2" class="outline-6">
<h6 id="sec-1-3-3-12-2"><span class="section-number-6">1.3.3.12.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-12-3" class="outline-6">
<h6 id="sec-1-3-3-12-3"><span class="section-number-6">1.3.3.12.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-12-3">
<dl class="org-dl">
<dt> region </dt><dd>a region
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-12-4" class="outline-6">
<h6 id="sec-1-3-3-12-4"><span class="section-number-6">1.3.3.12.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-12-4">
<p>
Returns the color of the region
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-13" class="outline-5">
<h5 id="sec-1-3-3-13"><span class="section-number-5">1.3.3.13</span> Function: <code>get-regions</code></h5>
<div class="outline-text-5" id="text-1-3-3-13">
</div><div id="outline-container-sec-1-3-3-13-1" class="outline-6">
<h6 id="sec-1-3-3-13-1"><span class="section-number-6">1.3.3.13.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-13-1">
<div class="org-src-container">

<pre class="src src-lisp">(get-regions)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-13-2" class="outline-6">
<h6 id="sec-1-3-3-13-2"><span class="section-number-6">1.3.3.13.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-13-3" class="outline-6">
<h6 id="sec-1-3-3-13-3"><span class="section-number-6">1.3.3.13.3</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-13-3">
<p>
Returns the Obstacle Regions from the map
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-14" class="outline-5">
<h5 id="sec-1-3-3-14"><span class="section-number-5">1.3.3.14</span> Function: <code>get-scene-perception</code></h5>
<div class="outline-text-5" id="text-1-3-3-14">
</div><div id="outline-container-sec-1-3-3-14-1" class="outline-6">
<h6 id="sec-1-3-3-14-1"><span class="section-number-6">1.3.3.14.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-14-1">
<div class="org-src-container">

<pre class="src src-lisp">(get-scene-perception &amp;optional (cuboid 1) (pose-estimation nil)
                      (object-ids nil))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-14-2" class="outline-6">
<h6 id="sec-1-3-3-14-2"><span class="section-number-6">1.3.3.14.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-14-3" class="outline-6">
<h6 id="sec-1-3-3-14-3"><span class="section-number-6">1.3.3.14.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-14-3">
<dl class="org-dl">
<dt> cuboid </dt><dd></dd>
<dt> pose-estimation </dt><dd>Determines wether perception pipeline should estimate the pose of the objects
</dd>
<dt> object-ids </dt><dd>Ids of the objects
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-14-4" class="outline-6">
<h6 id="sec-1-3-3-14-4"><span class="section-number-6">1.3.3.14.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-14-4">
<p>
Get the objects recognized by the scene camera
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-15" class="outline-5">
<h5 id="sec-1-3-3-15"><span class="section-number-5">1.3.3.15</span> Function: <code>handle-object</code></h5>
<div class="outline-text-5" id="text-1-3-3-15">
</div><div id="outline-container-sec-1-3-3-15-1" class="outline-6">
<h6 id="sec-1-3-3-15-1"><span class="section-number-6">1.3.3.15.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-15-1">
<div class="org-src-container">

<pre class="src src-lisp">(handle-object matched-object)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-15-2" class="outline-6">
<h6 id="sec-1-3-3-15-2"><span class="section-number-6">1.3.3.15.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-15-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-16" class="outline-5">
<h5 id="sec-1-3-3-16"><span class="section-number-5">1.3.3.16</span> Function: <code>handle-object-obstacle</code></h5>
<div class="outline-text-5" id="text-1-3-3-16">
</div><div id="outline-container-sec-1-3-3-16-1" class="outline-6">
<h6 id="sec-1-3-3-16-1"><span class="section-number-6">1.3.3.16.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-16-1">
<div class="org-src-container">

<pre class="src src-lisp">(handle-object-obstacle matched-object)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-16-2" class="outline-6">
<h6 id="sec-1-3-3-16-2"><span class="section-number-6">1.3.3.16.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-16-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-17" class="outline-5">
<h5 id="sec-1-3-3-17"><span class="section-number-5">1.3.3.17</span> Function: <code>handle-object-unknown-or-table</code></h5>
<div class="outline-text-5" id="text-1-3-3-17">
</div><div id="outline-container-sec-1-3-3-17-1" class="outline-6">
<h6 id="sec-1-3-3-17-1"><span class="section-number-6">1.3.3.17.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-17-1">
<div class="org-src-container">

<pre class="src src-lisp">(handle-object-unknown-or-table matched-object)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-17-2" class="outline-6">
<h6 id="sec-1-3-3-17-2"><span class="section-number-6">1.3.3.17.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-17-2">
<p>
Not documented.
</p>



<hr  />
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-18" class="outline-5">
<h5 id="sec-1-3-3-18"><span class="section-number-5">1.3.3.18</span> Function: <code>recognize-objects-of-interest</code></h5>
<div class="outline-text-5" id="text-1-3-3-18">
</div><div id="outline-container-sec-1-3-3-18-1" class="outline-6">
<h6 id="sec-1-3-3-18-1"><span class="section-number-6">1.3.3.18.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-3-18-1">
<div class="org-src-container">

<pre class="src src-lisp">(recognize-objects-of-interest colors)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3-18-2" class="outline-6">
<h6 id="sec-1-3-3-18-2"><span class="section-number-6">1.3.3.18.2</span> Description</h6>
</div>


<div id="outline-container-sec-1-3-3-18-3" class="outline-6">
<h6 id="sec-1-3-3-18-3"><span class="section-number-6">1.3.3.18.3</span> Arguments</h6>
<div class="outline-text-6" id="text-1-3-3-18-3">
<dl class="org-dl">
<dt> colors </dt><dd>Colors of the objects
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-3-3-18-4" class="outline-6">
<h6 id="sec-1-3-3-18-4"><span class="section-number-6">1.3.3.18.4</span> Description</h6>
<div class="outline-text-6" id="text-1-3-3-18-4">
<p>
Recognizes Objects of Interest. It gets a list of colors and returns a list of objects that matches these colors.
</p>
</div>
</div>
</div>
</div>





<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Internal Generic Functions</h4>
<div class="outline-text-4" id="text-1-3-4">
<hr  />
</div>
