suturo_planning_pm_perception/doc/suturo-planning-pm-perception.org
**** Generic Function: =call-action=                                        :generic:


***** Syntax

#+BEGIN_SRC lisp
(call-action action &rest params)
#+END_SRC


***** Description

Not documented.


***** Methods

- (=call-action= (action-sym0                 (eql cram-designator
  properties:find-objects-in-map)) &rest params1)
- (=call-action= (action-sym542 (eql cram-designator-properties:focus-object))
  &rest params543)
- (=call-action= (action-sym444 (eql cram-designator-properties:classify
  object)) &rest params445)
- (=call-action= (action-sym419                 (eql cram-designator
  properties:pose-estimate-object)) &rest params420)
- (=call-action= (action-sym398                 (eql suturo-planning-pm
  perception::perceive-scene-with-origin)) &rest params399)
- (=call-action= (action-sym377                 (eql cram-designator
  properties:perceive-scene-with)) &rest params378)
- (=call-action= (action-sym356 (eql cram-designator-properties:perceive))
  &rest params357)
- (=call-action= :around (action-sym [[class t][=t=]]) &rest params)
- (=call-action= (action-sym [[class t][=t=]]) &rest params)
- (=call-action= (action-sym7                 (eql cram-designator
  properties:get-gripper-perception)) &rest params8)






** Ambiguous Symbols


*** Suturo-Planning-Pm-Perception

# target: <<suturo-planning-pm-perception>>
Disambiguation.

- Class: [[class suturo-planning-pm-perception][=suturo-planning-pm
  perception:suturo-planning-pm-perception=]]
- Package: [[package suturo-planning-pm-perception][=suturo-planning-pm
  perception:suturo-planning-pm-perception=]]




** Index

 [[index A][A]]  [[index C][C]]  [[index D][D]]  [[index F][F]]  [[index G][G]]
 [[index H][H]]  [[index R][R]]  [[index S][S]]  [[index
NONALPHABETIC][NONALPHABETIC]]  


*** Nonalphabetic


# link target: <<index NONALPHABETIC>>
- [[variable *body*][=suturo-planning-pm-perception::*body*=]], Variable



*** A


# link target: <<index A>>
- [[function add-region-to-classified-regions][=suturo-planning-pm
  perception::add-region-to-classified-regions=]], Function
- [[function analyze-perceived-object][=suturo-planning-pm-perception::analyze
  perceived-object=]], Function



*** C


# link target: <<index C>>
- [[generic-function call-action][=suturo-planning-pm-perception::call
  action=]], Generic Function
- [[function call-classify-object][=suturo-planning-pm-perception::call
  classify-object=]], Function
- [[function call-euroc-object-to-odom-combined][=suturo-planning-pm
  perception::call-euroc-object-to-odom-combined=]], Function
- [[function call-gripper-service][=suturo-planning-pm-perception::call-gripper
  service=]], Function
- [[function call-scene-service][=suturo-planning-pm-perception::call-scene
  service=]], Function
- [[function call-service-add-point-cloud][=suturo-planning-pm-perception::call
  service-add-point-cloud=]], Function
- [[function compare-object-and-regions][=suturo-planning-pm
  perception::compare-object-and-regions=]], Function
- [[function create-capability-string][=suturo-planning-pm-perception::create
  capability-string=]], Function



*** D


# link target: <<index D>>
- [[macro def-action-handler][=suturo-planning-pm-perception::def-action
  handler=]], Macro



*** F


# link target: <<index F>>
- [[function find-regions-with-same-color][=suturo-planning-pm-perception::find
  regions-with-same-color=]], Function



*** G


# link target: <<index G>>
- [[function get-obj-color][=suturo-planning-pm-perception::get-obj-color=]],
  Function
- [[function get-region-color][=suturo-planning-pm-perception::get-region
  color=]], Function
- [[function get-regions][=suturo-planning-pm-perception::get-regions=]],
  Function
- [[function get-scene-perception][=suturo-planning-pm-perception::get-scene
  perception=]], Function



*** H


# link target: <<index H>>
- [[function handle-object][=suturo-planning-pm-perception::handle-object=]],
  Function
- [[function handle-object-obstacle][=suturo-planning-pm-perception::handle
  object-obstacle=]], Function
- [[function handle-object-unknown-or-table][=suturo-planning-pm
  perception::handle-object-unknown-or-table=]], Function



*** R


# link target: <<index R>>
- [[function recognize-objects-of-interest][=suturo-planning-pm
  perception::recognize-objects-of-interest=]], Function



*** S


# link target: <<index S>>
- [[class suturo-planning-pm-perception][=suturo-planning-pm-perception:suturo
  planning-pm-perception=]], Class
- [[package suturo-planning-pm-perception][=suturo-planning-pm
  perception:suturo-planning-pm-perception=]], Package





* Colophon

This documentation was generated from Common Lisp source code using CLOD, version 1.0.
The latest version of CLOD is available [[http://bitbucket.org/eeeickythump/clod/][here]].
