suturo_planning_pm_perception/doc/suturo-planning-pm-perception.html


<div id="outline-container-sec-1-3-4-1" class="outline-5">
<h5 id="sec-1-3-4-1"><span class="section-number-5">1.3.4.1</span> Generic Function: <code>call-action</code></h5>
<div class="outline-text-5" id="text-1-3-4-1">
</div><div id="outline-container-sec-1-3-4-1-1" class="outline-6">
<h6 id="sec-1-3-4-1-1"><span class="section-number-6">1.3.4.1.1</span> Syntax</h6>
<div class="outline-text-6" id="text-1-3-4-1-1">
<div class="org-src-container">

<pre class="src src-lisp">(call-action action &amp;rest params)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-4-1-2" class="outline-6">
<h6 id="sec-1-3-4-1-2"><span class="section-number-6">1.3.4.1.2</span> Description</h6>
<div class="outline-text-6" id="text-1-3-4-1-2">
<p>
Not documented.
</p>
</div>
</div>


<div id="outline-container-sec-1-3-4-1-3" class="outline-6">
<h6 id="sec-1-3-4-1-3"><span class="section-number-6">1.3.4.1.3</span> Methods</h6>
<div class="outline-text-6" id="text-1-3-4-1-3">
<ul class="org-ul">
<li>(<code>call-action</code> (action-sym0                 (eql cram-designator
properties:find-objects-in-map)) &amp;rest params1)
</li>
<li>(<code>call-action</code> (action-sym542 (eql cram-designator-properties:focus-object))
&amp;rest params543)
</li>
<li>(<code>call-action</code> (action-sym444 (eql cram-designator-properties:classify
object)) &amp;rest params445)
</li>
<li>(<code>call-action</code> (action-sym419                 (eql cram-designator
properties:pose-estimate-object)) &amp;rest params420)
</li>
<li>(<code>call-action</code> (action-sym398                 (eql suturo-planning-pm
perception::perceive-scene-with-origin)) &amp;rest params399)
</li>
<li>(<code>call-action</code> (action-sym377                 (eql cram-designator
properties:perceive-scene-with)) &amp;rest params378)
</li>
<li>(<code>call-action</code> (action-sym356 (eql cram-designator-properties:perceive))
&amp;rest params357)
</li>
<li>(<code>call-action</code> :around (action-sym <i><code>t</code></i>) &amp;rest params)
</li>
<li>(<code>call-action</code> (action-sym <i><code>t</code></i>) &amp;rest params)
</li>
<li>(<code>call-action</code> (action-sym7                 (eql cram-designator
properties:get-gripper-perception)) &amp;rest params8)
</li>
</ul>
</div>
</div>
</div>
</div>
</div>






<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Ambiguous Symbols</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Suturo-Planning-Pm-Perception</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Disambiguation.
</p>

<ul class="org-ul">
<li>Class: <i><code>suturo-planning-pm
  perception:suturo-planning-pm-perception</code></i>
</li>
<li>Package: <i><code>suturo-planning-pm
  perception:suturo-planning-pm-perception</code></i>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Index</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<i>A</i>  <i>C</i>  <i>D</i>  <i>F</i>  <i>G</i>
<i>H</i>  <i>R</i>  <i>S</i>  <i>NONALPHABETIC</i>  
</p>
</div>


<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Nonalphabetic</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception::*body*</code></i>, Variable
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> A</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li><i><code>suturo-planning-pm
  perception::add-region-to-classified-regions</code></i>, Function
</li>
<li><i><code>suturo-planning-pm-perception::analyze
  perceived-object</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> C</h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception::call
  action</code></i>, Generic Function
</li>
<li><i><code>suturo-planning-pm-perception::call
  classify-object</code></i>, Function
</li>
<li><i><code>suturo-planning-pm
  perception::call-euroc-object-to-odom-combined</code></i>, Function
</li>
<li><i><code>suturo-planning-pm-perception::call-gripper
  service</code></i>, Function
</li>
<li><i><code>suturo-planning-pm-perception::call-scene
  service</code></i>, Function
</li>
<li><i><code>suturo-planning-pm-perception::call
  service-add-point-cloud</code></i>, Function
</li>
<li><i><code>suturo-planning-pm
  perception::compare-object-and-regions</code></i>, Function
</li>
<li><i><code>suturo-planning-pm-perception::create
  capability-string</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> D</h4>
<div class="outline-text-4" id="text-1-5-4">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception::def-action
  handler</code></i>, Macro
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-5" class="outline-4">
<h4 id="sec-1-5-5"><span class="section-number-4">1.5.5</span> F</h4>
<div class="outline-text-4" id="text-1-5-5">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception::find
  regions-with-same-color</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-6" class="outline-4">
<h4 id="sec-1-5-6"><span class="section-number-4">1.5.6</span> G</h4>
<div class="outline-text-4" id="text-1-5-6">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception::get-obj-color</code></i>,
Function
</li>
<li><i><code>suturo-planning-pm-perception::get-region
  color</code></i>, Function
</li>
<li><i><code>suturo-planning-pm-perception::get-regions</code></i>,
Function
</li>
<li><i><code>suturo-planning-pm-perception::get-scene
  perception</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-7" class="outline-4">
<h4 id="sec-1-5-7"><span class="section-number-4">1.5.7</span> H</h4>
<div class="outline-text-4" id="text-1-5-7">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception::handle-object</code></i>,
Function
</li>
<li><i><code>suturo-planning-pm-perception::handle
  object-obstacle</code></i>, Function
</li>
<li><i><code>suturo-planning-pm
  perception::handle-object-unknown-or-table</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-8" class="outline-4">
<h4 id="sec-1-5-8"><span class="section-number-4">1.5.8</span> R</h4>
<div class="outline-text-4" id="text-1-5-8">
<ul class="org-ul">
<li><i><code>suturo-planning-pm
  perception::recognize-objects-of-interest</code></i>, Function
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-1-5-9" class="outline-4">
<h4 id="sec-1-5-9"><span class="section-number-4">1.5.9</span> S</h4>
<div class="outline-text-4" id="text-1-5-9">
<ul class="org-ul">
<li><i><code>suturo-planning-pm-perception:suturo
  planning-pm-perception</code></i>, Class
</li>
<li><i><code>suturo-planning-pm
  perception:suturo-planning-pm-perception</code></i>, Package
</li>
</ul>
</div>
</div>
</div>
</div>





<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Colophon</h2>
<div class="outline-text-2" id="text-2">
<p>
This documentation was generated from Common Lisp source code using CLOD, version 1.0.
The latest version of CLOD is available <a href="http://bitbucket.org/eeeickythump/clod/">here</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: CLOD</p>
<p class="date">Created: 2015-03-13 Fr 14:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
